Merge pull request #1 from couzic/graph-rag
Graph rag
